MikroElektronika/core_packages/dsPIC/XC16/def/PIC24F08KL301/mcu.h
/* SPI2BUF */
/* Bitname _SSPBUF cannot be defined because it is used by more than one SFR */
#define _SPI2BUF SPI2BUFbits.SPI2BUF

/* SSP2CON1 */
/* Bitname _SSPM cannot be defined because it is used by more than one SFR */
/* Bitname _CKP cannot be defined because it is used by more than one SFR */
/* Bitname _SSPEN cannot be defined because it is used by more than one SFR */
/* Bitname _SSPOV cannot be defined because it is used by more than one SFR */
/* Bitname _WCOL cannot be defined because it is used by more than one SFR */
/* Bitname _SSPM0 cannot be defined because it is used by more than one SFR */
/* Bitname _SSPM1 cannot be defined because it is used by more than one SFR */
/* Bitname _SSPM2 cannot be defined because it is used by more than one SFR */
/* Bitname _SSPM3 cannot be defined because it is used by more than one SFR */

/* SSP2CON2 */
/* Bitname _SEN cannot be defined because it is used by more than one SFR */
/* Bitname _RSEN cannot be defined because it is used by more than one SFR */
/* Bitname _PEN cannot be defined because it is used by more than one SFR */
/* Bitname _RCEN cannot be defined because it is used by more than one SFR */
/* Bitname _ACKEN cannot be defined because it is used by more than one SFR */
/* Bitname _ACKDT cannot be defined because it is used by more than one SFR */
/* Bitname _ACKSTAT cannot be defined because it is used by more than one SFR */
/* Bitname _GCEN cannot be defined because it is used by more than one SFR */
/* Bitname _ADMSK cannot be defined because it is used by more than one SFR */
/* Bitname _ADMSK1 cannot be defined because it is used by more than one SFR */
/* Bitname _ADMSK2 cannot be defined because it is used by more than one SFR */
/* Bitname _ADMSK3 cannot be defined because it is used by more than one SFR */
/* Bitname _ADMSK4 cannot be defined because it is used by more than one SFR */
/* Bitname _ADMSK5 cannot be defined because it is used by more than one SFR */

/* SSP2CON3 */
/* Bitname _DHEN cannot be defined because it is used by more than one SFR */
/* Bitname _AHEN cannot be defined because it is used by more than one SFR */
/* Bitname _SBCDE cannot be defined because it is used by more than one SFR */
/* Bitname _SDAHT cannot be defined because it is used by more than one SFR */
/* Bitname _BOEN cannot be defined because it is used by more than one SFR */
/* Bitname _SCIE cannot be defined because it is used by more than one SFR */
/* Bitname _PCIE cannot be defined because it is used by more than one SFR */
/* Bitname _ACKTIM cannot be defined because it is used by more than one SFR */

/* SSP2STAT */
/* Bitname _BF cannot be defined because it is used by more than one SFR */
/* Bitname _UA cannot be defined because it is used by more than one SFR */
/* Bitname _R_NOT_W cannot be defined because it is used by more than one SFR */
/* Bitname _S cannot be defined because it is used by more than one SFR */
/* Bitname _P cannot be defined because it is used by more than one SFR */
/* Bitname _D_NOT_A cannot be defined because it is used by more than one SFR */
/* Bitname _CKE cannot be defined because it is used by more than one SFR */
/* Bitname _SMP cannot be defined because it is used by more than one SFR */
/* Bitname _R_W cannot be defined because it is used by more than one SFR */
/* Bitname _D_A cannot be defined because it is used by more than one SFR */
/* Bitname _NOT_W cannot be defined because it is used by more than one SFR */
/* Bitname _NOT_A cannot be defined because it is used by more than one SFR */
/* Bitname _NOT_WRITE cannot be defined because it is used by more than one SFR */
/* Bitname _NOT_ADDRESS cannot be defined because it is used by more than one SFR */
/* Bitname _READ_WRITE cannot be defined because it is used by more than one SFR */
/* Bitname _DATA_ADDRESS cannot be defined because it is used by more than one SFR */
/* Bitname _I2C_READ cannot be defined because it is used by more than one SFR */
/* Bitname _I2C_START cannot be defined because it is used by more than one SFR */
/* Bitname _I2C_STOP cannot be defined because it is used by more than one SFR */
/* Bitname _I2C_DAT cannot be defined because it is used by more than one SFR */

/* I2C2ADD */
/* Bitname _SSPADD cannot be defined because it is used by more than one SFR */
/* Bitname _I2CADD cannot be defined because it is used by more than one SFR */

/* SSP2ADD */
/* Bitname _SSPADD cannot be defined because it is used by more than one SFR */
/* Bitname _I2CADD cannot be defined because it is used by more than one SFR */

/* I2C2MSK */
/* Bitname _MSK0 cannot be defined because it is used by more than one SFR */
/* Bitname _MSK1 cannot be defined because it is used by more than one SFR */
/* Bitname _MSK2 cannot be defined because it is used by more than one SFR */
/* Bitname _MSK3 cannot be defined because it is used by more than one SFR */
/* Bitname _MSK4 cannot be defined because it is used by more than one SFR */
/* Bitname _MSK5 cannot be defined because it is used by more than one SFR */
/* Bitname _MSK6 cannot be defined because it is used by more than one SFR */
/* Bitname _MSK7 cannot be defined because it is used by more than one SFR */
/* Bitname _AMSK cannot be defined because it is used by more than one SFR */

/* SSP2MSK */
/* Bitname _MSK0 cannot be defined because it is used by more than one SFR */
/* Bitname _MSK1 cannot be defined because it is used by more than one SFR */
/* Bitname _MSK2 cannot be defined because it is used by more than one SFR */
/* Bitname _MSK3 cannot be defined because it is used by more than one SFR */
/* Bitname _MSK4 cannot be defined because it is used by more than one SFR */
/* Bitname _MSK5 cannot be defined because it is used by more than one SFR */
/* Bitname _MSK6 cannot be defined because it is used by more than one SFR */
/* Bitname _MSK7 cannot be defined because it is used by more than one SFR */
/* Bitname _AMSK cannot be defined because it is used by more than one SFR */

